Tekla.Structures.Drawing.Symbol.SymbolAttributes
The SymbolAttributes class contains the attributes for the symbol.

Tekla.Structures.Drawing.Symbol.SymbolAttributes.Color
The symbol color. Does not have an effect on symbols
where the color is already defined in the symbol file.

Tekla.Structures.Drawing.Symbol.SymbolAttributes.TrueColor
The true color (RGB enabled) of the symbol. Does not have an effect on symbols
where the color is already defined in the symbol file.
Throws System.ArgumentOutOfRangeException: The get method will
throw if the inputColor is not supported (0-7, 120 for example).
You should use this function in a try-catch statement, since
non-supported colors are used in TeklaStructures, especially in
older models. Define your own catch logic (default color, error
message, etc) based on your use case.

Tekla.Structures.Drawing.Symbol.SymbolAttributes.Height
The height of the symbol.

Tekla.Structures.Drawing.Symbol.SymbolAttributes.Angle
The angle of the symbol. Cannot be changed for an
editor-created symbol when the symbol is created "along line".

Tekla.Structures.Drawing.Symbol.SymbolAttributes.Frame
The frame for the symbol.

Tekla.Structures.Drawing.Symbol.SymbolAttributes.PreferredPlacing
The type of placing the object should use.
See the preferred placing types for different types of placing.

Tekla.Structures.Drawing.Symbol.SymbolAttributes.#ctor(System.Boolean)
Creates a new default attributes instance that doesn't load attributes.

Tekla.Structures.Drawing.Symbol.SymbolAttributes.#ctor
Creates a new default symbol attributes instance that loads standard attributes.

Tekla.Structures.Drawing.Symbol.SymbolAttributes.#ctor(System.String)
Creates a symbol attributes instance that loads the specified attributes.
AttributesFile: The filename of the attributes file.

Tekla.Structures.Drawing.Symbol.SymbolAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
attributeFile: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.Symbol.SymbolAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.